net.tangly.fsm/src/site/pics/fsm-washer.dot
digraph G {
  compound=true;

  subgraph cluster1001 {
    style=invis;
    subgraph cluster1 {
      style="visible, dashed, filled";
      label = "Running"
      Washing [style="dashed"];
      Rinsing [];
      Drying [style="bold"];
    }
  }
  End [style="bold"];
  PowerOff [];
  Drying -> End [ltail=cluster1, label="Stop"];
  Drying -> PowerOff [ltail=cluster1, label="CutPower"];
  Washing -> Rinsing [label="Rinse"];
  Rinsing -> Drying [label="Dry"];
  PowerOff -> Drying [lhead=cluster1, label="RestorePower"];
}
